In [36]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = [10,8]  # Set default figure size
import requests

d = pd.Series(np.random.randn(4), name = 'daily returns')
mul = d * 100
print(mul)
print(d.abs())
d.describe()

0    -7.003744
1    53.086886
2   -45.441267
3    91.475039
Name: daily returns, dtype: float64
0    0.070037
1    0.530869
2    0.454413
3    0.914750
Name: daily returns, dtype: float64

count    4.000000
mean     0.230292
std      0.610423
min     -0.454413
25%     -0.166131
50%      0.230416
75%      0.626839
max      0.914750
Name: daily returns, dtype: float64

In [37]:
d.index = ['google', 'facebook', 'twitter', 'amazon']
print(d)
print(d['amazon'])
d['google'] = 0
print(d)
'facebook' in d

google     -0.070037
facebook    0.530869
twitter    -0.454413
amazon      0.914750
Name: daily returns, dtype: float64
0.9147503858783038
google      0.000000
facebook    0.530869
twitter    -0.454413
amazon      0.914750
Name: daily returns, dtype: float64

True

In [38]:
df = pd.read_csv('https://raw.githubusercontent.com/QuantEcon/lecture-python-programming/master/source/_static/lecture_specific/pandas/data/test_pwt.csv')
type(df)

pandas.core.frame.DataFrame

In [22]:
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
A,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
B,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
C,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
D,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
E,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
F,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
G,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
H,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [39]:
#select a row we used python indices
df[2:6]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546

In [40]:
#select a column by passing the column name as an array like ['country', 'cc']
df[['country', 'cc']]

         country         cc
0      Argentina  75.716805
1      Australia  67.759026
2          India  64.575551
3         Israel  64.436451
4         Malawi  74.707624
5   South Africa  72.718710
6  United States  72.347054
7        Uruguay  78.978740

In [41]:
# To select both row and column we use iloc
df.iloc[0:3, 3:]

           POP      XRAT         tcgdp         cc         cg
0    37335.653   0.99950  2.950722e+05  75.716805   5.578804
1    19053.186   1.72483  5.418047e+05  67.759026   6.720098
2  1006300.297  44.94160  1.728144e+06  64.575551  14.072206

In [42]:
#To select rows and columns using a mixture of integers and labels, the loc attribute can be used in a
df.loc[df.index[2:5], ['country', 'tcgdp']]

  country         tcgdp
2   India  1.728144e+06
3  Israel  1.292539e+05
4  Malawi  5.026222e+03

In [43]:
df[df.POP >= 20000]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.99950,2.950722e+05,75.716805,5.578804
2,India,IND,2000,1006300.297,44.94160,1.728144e+06,64.575551,14.072206
5,South Africa,ZAF,2000,45064.098,6.93983,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.00000,9.898700e+06,72.347054,6.032454

In [44]:
df.query("country in ['Argentina', 'India', 'South Africa'] and POP > 40000")

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
2,India,IND,2000,1006300.297,44.94160,1.728144e+06,64.575551,14.072206
5,South Africa,ZAF,2000,45064.098,6.93983,2.272424e+05,72.718710,5.726546

In [45]:
df[df.cc == max(df.cc)]
df[df.POP == min(df.POP)]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
7,Uruguay,URY,2000,3219.793,12.099592,25255.961693,78.97874,5.108068

In [46]:
df.loc[(df.cc + df.cg < 100) & (df.year == 2000) ,['country isocode', 'year','POP','XRAT']]

  country isocode  year          POP       XRAT
0             ARG  2000    37335.653   0.999500
1             AUS  2000    19053.186   1.724830
2             IND  2000  1006300.297  44.941600
3             ISR  2000     6114.570   4.077330
4             MWI  2000    11801.505  59.543808
5             ZAF  2000    45064.098   6.939830
6             USA  2000   282171.957   1.000000
7             URY  2000     3219.793  12.099592

In [47]:
df.loc[df.index[:2], ['country', 'year', 'POP']]

     country  year        POP
0  Argentina  2000  37335.653
1  Australia  2000  19053.186

In [48]:
df_subset = df[['country', 'POP', 'tcgdp']]
df_subset

         country          POP         tcgdp
0      Argentina    37335.653  2.950722e+05
1      Australia    19053.186  5.418047e+05
2          India  1006300.297  1.728144e+06
3         Israel     6114.570  1.292539e+05
4         Malawi    11801.505  5.026222e+03
5   South Africa    45064.098  2.272424e+05
6  United States   282171.957  9.898700e+06
7        Uruguay     3219.793  2.525596e+04

In [49]:
df_subset.to_csv('pwt_df.csv', index = False)

In [50]:
df[['year', 'POP', 'XRAT', 'tcgdp', 'cc', 'cg']].apply(max)

year     2.000000e+03
POP      1.006300e+06
XRAT     5.954381e+01
tcgdp    9.898700e+06
cc       7.897874e+01
cg       1.407221e+01
dtype: float64

In [51]:
df.apply(lambda row: row, axis=1)

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [52]:
complexCondition = df.apply(
    lambda row: row.POP > 40000 if row.country in ['Argentina', 'India', 'South Africa'] else row.POP < 20000,
    axis=1), ['country', 'year', 'POP', 'XRAT', 'tcgdp']
df.loc[complexCondition]

        country  year          POP       XRAT         tcgdp
1     Australia  2000    19053.186   1.724830  5.418047e+05
2         India  2000  1006300.297  44.941600  1.728144e+06
3        Israel  2000     6114.570   4.077330  1.292539e+05
4        Malawi  2000    11801.505  59.543808  5.026222e+03
5  South Africa  2000    45064.098   6.939830  2.272424e+05
7       Uruguay  2000     3219.793  12.099592  2.525596e+04

In [53]:
df.query("POP >= 2000")

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [54]:
df.query("country in ['Argentina', 'Australia', 'india', 'Israel'] and POP >= 1000")

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.99950,295072.21869,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.72483,541804.65210,67.759026,6.720098
3,Israel,ISR,2000,6114.570,4.07733,129253.89423,64.436451,10.266688

In [55]:
df.loc[(df.cg + df.cc <= 100) & (df.POP >= 10000), ['year', 'cc', 'cg', 'XRAT']]

   year         cc         cg       XRAT
0  2000  75.716805   5.578804   0.999500
1  2000  67.759026   6.720098   1.724830
2  2000  64.575551  14.072206  44.941600
4  2000  74.707624  11.658954  59.543808
5  2000  72.718710   5.726546   6.939830
6  2000  72.347054   6.032454   1.000000

In [56]:
result = df.apply(lambda row: row.cc >= 60 if row.country in ['Argentina', 'Australia','India'] else row.POP < 3000, axis=1), ['country','year', 'cc', 'cg', 'XRAT']
df.loc[result]

     country  year         cc         cg      XRAT
0  Argentina  2000  75.716805   5.578804   0.99950
1  Australia  2000  67.759026   6.720098   1.72483
2      India  2000  64.575551  14.072206  44.94160

In [57]:
df.where(df.POP > 20000, False)

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.9995,295072.21869,75.716805,5.578804
1,False,False,False,False,False,False,False,False
2,India,IND,2000,1006300.297,44.9416,1728144.3748,64.575551,14.072206
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,South Africa,ZAF,2000,45064.098,6.93983,227242.36949,72.71871,5.726546
6,United States,USA,2000,282171.957,1.0,9898700.0,72.347054,6.032454
7,False,False,False,False,False,False,False,False

In [58]:
df.loc[df.cg == max(df.cg), 'cg'] = np.nan
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,NaN
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [59]:
def update_row(row):
    row.POP = np.nan if row.POP <= 10000 else row.POP

    row.XRAT = row.XRAT / 10
    return row
df.apply(update_row, axis=1)

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.099950,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,0.172483,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,4.494160,1.728144e+06,64.575551,NaN
3,Israel,ISR,2000,NaN,0.407733,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,5.954381,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,0.693983,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,0.100000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,NaN,1.209959,2.525596e+04,78.978740,5.108068

In [61]:
df.applymap(lambda x: round(x, 1) if type(x) != str else x)

         country country isocode  year        POP  XRAT      tcgdp    cc    cg
0      Argentina             ARG  2000    37335.7   1.0   295072.2  75.7   5.6
1      Australia             AUS  2000    19053.2   1.7   541804.7  67.8   6.7
2          India             IND  2000  1006300.3  44.9  1728144.4  64.6   NaN
3         Israel             ISR  2000     6114.6   4.1   129253.9  64.4  10.3
4         Malawi             MWI  2000    11801.5  59.5     5026.2  74.7  11.7
5   South Africa             ZAF  2000    45064.1   6.9   227242.4  72.7   5.7
6  United States             USA  2000   282172.0   1.0  9898700.0  72.3   6.0
7        Uruguay             URY  2000     3219.8  12.1    25256.0  79.0   5.1

In [67]:
for idx in list(zip([0, 3, 5, 6], [3, 4, 6, 2])):
    df.iloc[idx] = np.nan
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000.0,NaN,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000.0,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000.0,1006300.297,44.941600,1.728144e+06,64.575551,NaN
3,Israel,ISR,2000.0,6114.570,NaN,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000.0,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000.0,45064.098,6.939830,2.272424e+05,NaN,5.726546
6,United States,USA,NaN,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000.0,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [68]:
def replace_nan(x):
    if type(x) != str:
        return  0 if np.isnan(x) else x
    else:
        return x
df.apply(replace_nan, axis=1)

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''